Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/мДатыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мДатыДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмОснование</name>
    <comment>Промежуточный</comment>
    <type>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.мВнесениеДатыРешения</types>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.мАктирование</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.мВзаимозачет</types>
      <types>DocumentRef.мПродлениеСроков</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    Если ТекущийОбъект.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ДатаПодписанияЗаказчиком Тогда
        // автоматический расчет планового срока при внесении даты подписания заказчиком
        ПлановыйСрок = мРаботаСДоговорами.РассчитатьПлановыйСрокВыполненияДоговора(ТекущийОбъект.ЭтапДоговора, , Истина);
        
         Если ПлановыйСрок <> Неопределено Тогда
		 //Если ЗначениеЗаполнено(ПлановыйСрок) Тогда
            НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
            
            ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
            
            НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
            НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговора);
            НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
            
            НовыйНабор = НаборЗаписей.Добавить();
            НовыйНабор.Период = ТекущийОбъект.Период;
            НовыйНабор.ЭтапДоговора = ТекущийОбъект.ЭтапДоговора;
            НовыйНабор.Основание = ТекущийОбъект.Основание;
            НовыйНабор.ВидДатыДоговора = ВидДатыДоговораПлановыйСрок;
            НовыйНабор.Дата = ПлановыйСрок;
 			НовыйНабор.Установил = Пользователи.ТекущийПользователь();
           
            НаборЗаписей.Записать();
        КонецЕсли; 
        
    ИначеЕсли ТекущийОбъект.ВидДатыДоговора = Справочники.мВидыДатДоговоров.ДатаПродления Тогда
		Если Не ТекущийОбъект.ЭтапДоговора.ЗапретИзмененияПлановогоСрока Тогда
			НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
			
			ВидДатыДоговораПлановыйСрок = Справочники.мВидыДатДоговоров.ПлановыйСрок;
			
			НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
			НаборЗаписей.Отбор.ЭтапДоговора.Установить(ТекущийОбъект.ЭтапДоговора);
			НаборЗаписей.Отбор.ВидДатыДоговора.Установить(ВидДатыДоговораПлановыйСрок);
			
			НовыйНабор = НаборЗаписей.Добавить();
			НовыйНабор.Период = ТекущийОбъект.Период;
			НовыйНабор.ЭтапДоговора = ТекущийОбъект.ЭтапДоговора;
			НовыйНабор.Основание = ТекущийОбъект.Основание;
			НовыйНабор.ВидДатыДоговора = ВидДатыДоговораПлановыйСрок;
			НовыйНабор.Дата = ТекущийОбъект.Дата;
			НовыйНабор.Комментарий = ТекущийОбъект.Комментарий;
 			НовыйНабор.Установил = Пользователи.ТекущийПользователь();
			
			НаборЗаписей.Записать();
		КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период) Тогда
        // Это новая запись
        Если ЗначениеЗаполнено(Запись.ЭтапДоговора) Тогда
            Запись.Период = ТекущаяДатаСеанса();
		КонецЕсли;
		Запись.Установил = Пользователи.ТекущийПользователь();
    КонецЕсли; 
КонецПроцедуры
